Repository: SAML-Toolkits/wordpress-saml
Catalog: onelogin-saml-sso/lang/*/onelogin-saml-sso.po
Languages: es_es

source: Access Forbidden!
es_es: ¡Acceso prohibido!

source: OneLogin SSO/SAML Settings validation
es_es: Validar las configuraciones del Onelogin SSO/SAML

source: Debug mode
es_es: Modo Depuración

source: In production turn it off
es_es: En producción desactívalo

source: Strict mode
es_es: Modo Estricto

source: In production we recommend to turn it on.
es_es: En producción recomendamos activarlo.

source: SAML settings are
es_es: Las configuraciones SAML son

source: Found errors while validating SAML settings info.
es_es: Se encontraron errores mientras validabamos la información de las configuraciones SAML.

source: Force SAML Login is enabled, that means that the user will be redirected to the IdP before getting access to Wordpress.
es_es: Forzar el Login SAML está habilitado, esto significa que el usuario será redireccionado al IdP antes de poder acceder a Wordpress.

source: Single Log Out is enabled. If the SLO process fail, close your browser to be sure that session of the apps are closed.
es_es: El "Single Log Out" está habilitado. Si el proceso del SLO falla, cierra el navegador para asegurarte de que las sesión de las aplicaciones se cierre.

source: Single Log Out is disabled. If you log out from Wordpress your session at the IdP keeps alive.
es_es: "Single Log Out" está deshabilitado. Si cierras la sesión de wordpress tu sesión del IdP permanecerá activa.

source: There is a private key stored at the filesystem. Protect the 'certs' path. Nobody should be allowed to access:
es_es: Hay una clave privada almacenada en el sistema de ficheros. Protege el directorio 'certs'. Nadie debería poder acceder a el:

source: There is a private key stored at the database. (An attacker could own your database and get it. Take care)
es_es: Hay una clave privada almacenada en la base de datos. (Un atacante podría apoderarse de la base de datos y obtenerla. Tenga cuidado)

source: Private key/certs stored on database have priority over the private key/cert stored at filesystem
es_es: Las claves privadas/certificados almacenados en la base de datos tienen prioridad sobre las claves privadas/certificados almacenados en el sistema de ficheros

source: User will be created if not exists, based on the data sent by the IdP.
es_es: El usuario será creado si no existe, con los datos que son enviados desde el IdP.

source: If the user not exists, access is prevented.
es_es: Si el usuario no existe, no se le permite el acceso.

source: User account will be updated with the data sent by the IdP.
es_es: La cuenta del usuario será actualizada con los datos enviados del IdP.

source: Is important to set the attribute and the role mapping before auto-provisioning or updating an account.
es_es: Es importante establecer la correspondencia de roles y atributos cuando auto-provisionemos o actualicemos una cuenta.

source: Username
es_es: Nombre de usuario

source: E-mail
es_es: Correo electrónico

source: First Name
es_es: Nombre

source: Last Name
es_es: Apellidos

source: Role
es_es: Rol

source: Username mapping is required in order to enable the SAML Single Sign On
es_es: La correspondencia con el nombre de usuario es obligatoria para poder habilitar el SAML Single Sign On

source: E-mail mapping is required in order to enable the SAML Single Sign On
es_es: La correspondencia con el correo electrónico es obligatoria para poder habilitar el SAML Single Sign On

source: Notice that there are attributes without mapping:
es_es: Dese cuenta de que hay atributos sin correspondencia:

source: Administrator
es_es: Administrador

source: Author
es_es: Autor

source: Contributor
es_es: Colaborador

source: Subscriber
es_es: Suscriptor

source: Notice that there are roles without mapping:
es_es: Dese cuenta de que hay roles sin correspondencia:

source: Go to the metadata of this SP
es_es: Acceder a los metadatos del SP

source: Once configured, validate here your OneLogin SSO/SAML Settings
es_es: Una vez configurado, valide aquí sus configuraciones SSO/SAML

source: This plugin provides single sign-on via SAML and gives users one-click access to their WordPress accounts from identity providers like OneLogin
es_es: Este plugin proporciona Single sign a través del protocolo SAML y ofrece al usuario poder acceder con un click a su cuenta de Wordpress haciendo uso de un proveedor de identidad como OneLogin

source: For more information
es_es: Para más información

source: access to the
es_es: acceda a

source: Plugin Info
es_es: información del Plugin

source: or visit
es_es: o visite

source: IDENTITY PROVIDER SETTINGS
es_es: CONFIGURACIÓN DEL PROVEEDOR DE IDENTIDAD

source: IdP Entity Id
es_es: EntityId del IdP

source: Single Sign On Service Url
es_es: Url del Servicio de Single Sign On

source: Single Log Out Service Url
es_es: Url del Servicio de Single Log Out

source: X.509 Certificate
es_es: Certificado x.509

source: OPTIONS
es_es: OPCIONES

source: Create user if not exists
es_es: Crear usuario si no existe

source: Update user data
es_es: Actualizar datos de usuario

source: Force SAML login
es_es: Forzar login SAML

source: Match Wordpress account by
es_es: Relacionar cuenta de Wordpress a través del

source: ATTRIBUTE MAPPING
es_es: CORRESPONDENCIA DE ATRIBUTOS

source: ROLE MAPPING
es_es: CORRESPONDENCIA DE ROLES

source: CUSTOMIZE LINKS
es_es: LINKS PERSONALIZADOS

source: User Registration
es_es: Registro de usuario

source: Lost Password
es_es: Contraseña perdida

source: ADVANCED SETTINGS
es_es: CONFIGURACIÓN AVANZADA

source: Debug Mode
es_es: Modo Depuración

source: Strict Mode
es_es: Modo Estricto

source: Service Provider Entity Id
es_es: EntityId del Proveedor de Servicio

source: Encrypt nameID
es_es: nameID cifrado

source: Sign AuthnRequest
es_es: Firmar AuthnRequest

source: Sign LogoutRequest
es_es: F‫irmar LogoutRequest

source: Sign LogoutResponse
es_es: F‫irmar LogoutResponse

source: Reject Unsigned Messages
es_es: Rechazar mensajes no firmados

source: Reject Unsigned Assertions
es_es: Rechazar aserciones no firmadas

source: Reject Unencrypted Assertions
es_es: Rechazar aserciones no cifradas

source: Service Provider X.509 Certificate
es_es: Certificado x.509 del Proveedor de Servicio

source: Service Provider Private Key
es_es: Clave privada del Proveedor de Servicio

source: Identifier of the IdP entity. ("Issuer URL")
es_es: Identificador de la entidad IdP. ("Issuer URL")

source: SSO endpoint info of the IdP. URL target of the IdP where the SP will send the Authentication Request. ("SAML 2.0 Endpoint (HTTP)")
es_es: Información del punto de acceso del SSO del IdP. URL objetivo del IdP donde el SP enviará su AuthNRequest ("SAML 2.0 Endpoint (HTTP)")

source: SLO endpoint info of the IdP. URL target of the IdP where the SP will send the SLO Request. ("SLO Endpoint (HTTP)")
es_es: Información del punto de acceso del SLO del IdP. URL objetivo del IdP donde el SP enviará su SLO Request ("SLO Endpoint (HTTP)")

source: Public x509 certificate of the IdP. ("X.509 certificate")
es_es: Certificado público x509 del IdP. ("X.509 certificate")

source: Auto-provisioning. If user not exists, Wordpress will create a new user with the data provided by the IdP.<br>Review the Mapping section.
es_es: Auto-provisionamiento. Si el usuario no existe, Wordpress creará un nuevo usuario con los datos proporcionados por el IdP.<br>Revisar la sección de Correspondencias.

source: Auto-update. Wordpress will update the account of the user with the data provided by the IdP.<br>Review the Mapping section.
es_es: Actualización. Wordpress actualizará la cuenta del usuario con los datos proporcionados por el IdP.<br>Revisar la sección de Correspondencias.

source: Protect Wordpress and force the user to authenticate at the IdP in order to access
es_es: Proteger Wordpress y forzar al usuario a que se autentique en el IdP para poder acceder

source: Enable/disable Single Log Out. SLO is a complex functionality, the most common SLO implementation is based on front-channel (redirections), sometimes if the SLO workflow fails a user can be blocked in an unhandled view. If the admin does not controls the set of apps involved in the SLO process maybe is better to disable this functionality due could carry more problems than benefits.
es_es: Habilitar/Deshabilitar el Single Log Out. El SLO es una funcionalidad compleja, las implementaciones mas comunes de SLO están basadas en canales-frontales (redirecionamientos), algunas veces si el flujo de SLO falla un usuario puede verse bloqueado en una vista perdida. Si el administrador no posee control sobre el conjunto de aplicaciones involucradas en el proceso de SLO quizás sea mejor deshabilitar esta funcionalidad ya que puede conllevar mas problemas que beneficios.

source: Select what field will be used in order to find the user account. If you select the 'email' fieldname the plugin will prevent that the user can change his mail in his profile.
es_es: Selecciona que campo será usando a la hora de buscar la cuenta del usuario. Si eliges el campo 'Email' el plugin evitará que el usuario pueda cambiar su correo en su perfil.

source: The attribute that contains the role of the user, For example 'memberof'. If Wordpress can't figure what role assign to the user, it will assign the default role defined at the general settings.
es_es: El atributo que contiene el rol del usuario, Por ejemplo "memberof". Si Wordpress no puede averiguar que rol asignar al usuario, asignará el rol por defecto que se haya definido en la configuración general.

source: Enable it when your are debugging the SAML workflow. Errors and Warnigs will be showed.
es_es: Habilitar cuando quieras depurar el flujo SAML. Los errores y alertas serán mostrados.

source: If Strict mode is Enabled, then Wordpress will reject unsigned or unencrypted messages if it expects them signed or encrypted. Also will reject the messages if not strictly follow the SAML standard: Destination, NameId, Conditions ... are validated too.
es_es: SI el modo estricto está habilitado, entonces Wordpress rechazará mensajes no firmados o no encriptados, si así los espera). También rechazará los mensajes si no cumplen estrictamente el estandar SAML: El destino, nameID, condiciones... serán validados también.

source: Set the Entity ID for the Service Provider. If not provided, 'php-saml' will be used.
es_es: Establece el Entity ID del Proveedor de Servicio. Si no es proporcionado, 'php-saml' será usado.

source: The nameID sent by this SP will be encrypted.
es_es: El nameID que envíe el SP será cifrado.

source: The samlp:AuthnRequest messages sent by this SP will be signed.
es_es: El mensaje samlp:AuthnRequest enviado por el SP será firmado.

source: The samlp:logoutRequest messages sent by this SP will be signed.
es_es: El mensaje samlp:logoutRequest enviado por el SP será firmado.

source: The samlp:logoutResponse messages sent by this SP will be signed.
es_es: El mensaje samlp:logoutResponse enviado por el SP será firmado.

source: Reject unsigned samlp:Response, samlp:LogoutRequest and samlp:LogoutResponse received
es_es: Rechazar los samlp:Response, samlp:LogoutRequest and samlp:LogoutResponse que se reciban que no estén firmados.

source: Reject unsigned saml:Assertion received
es_es: Rechazar los saml:Assertion que se reciban que no estén firmados

source: Reject unencrypted saml:Assertion received
es_es: Rechazar los saml:Assertion que se reciban que no estén cifrados

source: Public x509 certificate of the SP. Leave this field empty if you gonna provide the cert by the sp.crt
es_es: Certificados público x509 del SP. Deja este campo vacío si vas a proporcionar el certificado a través del sp.crt

source: Private Key of the SP. Leave this field empty if you gonna provide the private key by the sp.key
es_es: Clave privada del SP. Deja este campo vacío si vas a proporcionar la clave a través del sp.key

source: Set here some info related to the IdP that will be connected with our Wordpress. You can find this values at the Onelogin's platform in the Wordpress App at the Single Sign-On tab
es_es: Configura aquí información relativa al IdP al que vas a conectar el Wordpress. Puedes obtener los valores accediendo a la plataforma de Onelogin en el conector de Wordpress en la pestaña Single Sign-On

source: In this section the behavior of the plugin is set.
es_es: En esta sección se establece el comportamiento del plugin.

source: Sometimes the names of the attributes sent by the IdP not match the names used by Wordpress for the user accounts. In this section we can set the mapping between IdP fields and Wordpress fields. Notice that this mapping could be also set at Onelogin's IdP
es_es: Algunas veces los nombres de atributos que son enviados por el IdP no coinciden con los nombres de atributos utilizados en las cuentas de usuario de Wordpress. En esta sección podemos establecer la correspondencia entre los campos del idP y los de Wordpress. Date cuenta que esta correspondencia también puede establecerse en el IdP de Onelogin.

source: The IdP can use it's own roles. Set in this section the mapping between IdP and Wordpress roles. Accepts multiple valued comma separated. Example: admin,owner,superuser
es_es: El IdP puede tener sus propios roles. Establece en esta sección la correspondencia entre los roles del IdP y los del Wordpress. Acepta multiples valores separados por comas. Por ejemplo: admin,owner,superuser

source: When we enable the SAML SSO to be integrated with a IdP some Wordpress links as 'user registration' or 'lost password' have no sense. Set here new urls in order to redirect the user to those url when executing these actions
es_es: Cuando habilitamos el SAM SSO para integrarlo con un IdP algunos links de Worpress como el 'registro de usuario' o el 'contraseña perdida' dejan de tener sertido. Aquú establecemos nuevas urls a las que redireccionar al usuario cuando ejecuten estas acciones

source: Handle some other parameters related to customizations and security issues.<br>If sign/encryption is enabled, then x509 cert and private key for the SP must be provided. There are 2 ways:<br> 1. Store them as files named sp.key and sp.crt on the 'certs' folder of the plugin. (be sure that the folder is protected and not exposed to internet)<br> 2. Store them at the database, filling the corresponding textareas. (take care of security issues)
es_es: Configura algunos parámetros relacionados con customizaciones y temas de seguridad. <br>Si la firma/cifrado estan habilitados, entonces tiene que proporcionarse al SP un certificado x509 y una clave privada. Hay 2 métodos:<br>1. Almacenalos como ficheros con nombres sp.key y sp.crt en la carpeta 'certs' del plugin. (aseguarate que la carpeta está protegida y no se expone a internet)<br>2. Almacenalos en la base de datos, rellenando sus correspondientes campos de texto.(ten cuidado de las implicaciones de seguridad)

source: There was at least one error processing the SAML Response
es_es: Hubo al menos un error procesando la SAML Response

source: Contact the administrator
es_es: Contacte con el administrador

source: The username could not be retrieved from the IdP and is required
es_es: El nombre de usuario no pudo ser obtenido del IdP y es obligatorio

source: The email could not be retrieved from the IdP and is required
es_es: El correo electrónico no pudo ser obtenido del IdP y es obligatorio

source: The username provided by the IdP
es_es: El nombre de usuario proporcionado por el IdP

source: is not valid and can't create the user at wordpress
es_es: no es válido y no puede crearse el usuario en Wordpress

source: User provided by the IdP
es_es: Usuario proporcionado por el IdP

source: not exists in wordpress and auto-provisioning is disabled.
es_es: no existe y el auto-provisionamiento en Wordpress está deshabiltado.

source: The Onelogin SSO/SAML plugin is not correctly configured.
es_es: EL plugin de Onelogin SSO/SAML no está configurado correctamente

source: If you are the administrator
es_es: Si eres el administrador

source: access using your wordpress credentials
es_es: accede utilizando tus credenciales de wordress

source: and fix the problem
es_es: y arregla el problema
